{"LSU vs. Texas Tech betting lines and pick – Tigers have conference history on their side in Texas Bowl": "The first of three SEC-Big 12 bowl game matchups takes place on Tuesday (9 p.m. ET, ESPN) when No. 20 LSU and Texas Tech tangle in the AdvoCare V100 Texas Bowl at NRG Stadium in Houston. The SEC has dominated the Big 12 in postseason play when the betting market expects it to win, going 15-2 SU and 14-3 ATS in the last 17 meetings as favorites.\n\nLine: LSU -7, Total: 73.5\n\nLine movement: The Wynn opened LSU as 7.5-point favorites on Dec. 7 with early-bird bettors snapping up the hook within hours and pushing the line to -7. The Westgate Las Vegas SuperBook dangled -5.5 as its initial offer but adjusted to -7 within 24 hours. The line has pretty much stayed at a touchdown since, but underdog bettors could find +7.5 at MGM the day before kickoff. The total is offered between 73.5 and 74.5 across Vegas. Visit our odds page for updated bowl game lines.\n\nTrends that matter: LSU is 6-14 ATS after allowing 20 points or less in its previous game....Texas Tech is 10-4-1 ATS in its last 15 games overall....The OVER is 7-1 in the Tigers' last eight games following a SU victory....The OVER is 13-3 in the Red Raiders' last 16 neutral-site games.\n\nBy the numbers: Tigers vs. Red Raiders\n\nLSU outlook (8-3 SU, 4-6-1 ATS): LSU fans are hoping the Tigers stay on track following a 19-7 victory over Texas A&M in the Bayou to close the regular season, after losing three in a row SU and ATS to Alabama, Arkansas and Mississippi.\n\nDefenses seemed to figure out LSU's offense at the end of the year: stuff the box, shut down RB Leonard Fournette — its best weapon — and force the less-than-dangerous Brandon Harris to throw. Though they faced some stouts units, LSU averaged only 16.5 points in its last four games (opposed to 38.9 before) and did not score over 20 in any of them. Harris' passing attempts jumped to 31.5 per game during the stretch from 18.4 prior.\n\nThe good news for LSU bettors is that Texas Tech pretty much shuns defense, and is one of the worst run stoppers in college football. Its 42.4 points and 531.4 total yards per game to FBS opponents ranks 124th and 125th, respectively. Moreover, it allows 267.7 rushing yards per contest (124th) at 5.8 per carry (125th). On the season, when LSU faces a team allowing more than 130 rushing yards per game, it is 4-1 ATS versus 0-5-1 against the number to those yielding less.\n\nOn D, the Tigers will be challenged by one of the nation's most high-powered (46.6 points per game) and quickest offenses (83.5 plays per game), an attack and pace they've rarely faced in the SEC. Establishing the run game will likely be LSU's best defense.\n\nMore on the Tigers: Stats and trends\n\nTexas Tech outlook (7-5 SU, 7-4-1 ATS): The Red Raiders employ an air-raid offense, throwing the ball 56.5 percent of the time from the shotgun position, ninth most nationally. Although Tech picks up 207 yards per game on the ground, the passing attack is primary, and how well defenses hold up to it is critical to the Raiders' success. Against teams yielding 6.7 or more yards per passing attempt on the season, coach Kliff Kingsbury's squad is 5-1 SU and ATS. It is 1-4 SU and 2-3 ATS against teams under that threshold. LSU enters the contest yielding 6.5.\n\nAs mentioned earlier, the Red Raiders defense is pretty atrocious. But they do one thing fairly well that may help them in this contest: force turnovers. They pick it off on 3.3 percent of opposing quarterback dropbacks (41st in the nation) and generate 1.8 takeaways per contest. Winning the turnover battle gives football teams a chance in nearly every game.\n\nMore on the Red Raiders: Stats and trends\n\nPick: LSU is deep and talented enough on defense to rotate guys and stay fresh against the Red Raiders' assault. Fournette will likely have a huge day, and the SN staff figures the Tigers to win by more than a touchdown. We'd like to see the number drift below a -7 again, and it may, but we'll lay the touchdown if we have to.\n\nPlay Gamblino for free and win a $1,500 entry into the world's largest sports betting competition, The SuperContest.", "​California vs. Air Force betting lines and pick – Cal favorite in Armed Forces Bowl": "One will not find two more contrasting styles among college football teams than Cal and Air Force, which meet in the Lockheed Martin Armed Forces Bowl on Tuesday (2 p.m. ET, ESPN). Coach Sonny Dykes employs an air-raid offense, with the Golden Bears passing the ball on 57 percent of plays (fifth most in the nation). The Falcons' triple-option attack rushes the ball on 82 percent of snaps (fourth-most). Which offense executes the best will most likely determine the winner.\n\nLine: Cal -7, Total: 67.5\n\nLine movement: The Wynn opened Cal as a 6.5-point favorite, moving to -7 within 24 hours of trading. About 24 hours before kickoff, most Vegas books were dealing -7, while MGM Resorts was at -6.5. The total opened 63 offshore and has been bet up to 67.5 and 68 at most outlets. Visit our odds page for updated bowl numbers.\n\nTrends that matter: Cal is 0-5 ATS in its last five against a team with a winning record….Air Force is 8-2 ATS in its last ten versus a team with a winning record….The OVER is 4-0 in the Falcons’ last four games….The UNDER is 8-1 in Cal’s last nine against a team with a winning record.\n\nBy the numbers: Golden Bears vs. Falcons\n\nCal outlook (7-5 SU, 5-7 ATS): Jared Goff leads Cal’s passing attack. The first-team All-Pac-12 junior might be the first quarterback taken in this year’s NFL Draft if he decides to declare (insiders expect he will). Goff set school records for passing yards (4,252) and passing touchdowns (37) this season. Altogether, he heads up an offense generating 512 total yards per game against FBS foes, 10th most nationally.\n\nThe defense covers a lot of ground, too, but on the back foot. Its 469.7 total yards allowed per contest ranks 110th worst in college football. It was particularly bad in the red zone, yielding the nation’s highest scoring rate inside the 20 by holding FBS opponents without a point just three percent of the time.\n\nCal was the nation’s leader in takeaways through the first six games, but it virtually dried up afterwards. Its 1.2 turnovers forced per game ranks 101st nationally.\n\nThe D’s 202.8 rushing yards allowed per game may hurt them the most against Air Force, though.\n\nMore on the Golden Bears: Stats and trends\n\nAir Force outlook (8-5 SU, 9-4 ATS): The Falcons' 321.8 rushing yards per game is third-best in the nation, and their 5.4 yards per attempt is 12th. It is a team effort, with seven runners gaining 300 yards or more on the season. The unit's dependence on the run makes it difficult for them to come from behind, though. All five of Air Force's losses came after it trailed at halftime, and the Falcons were leading at half in all their wins.\n\nThe defense benefits from the offense's ability to manufacture long drives, but still is subpar at slowing opponents. It yields a middling 4.5 rushing yards (72nd) and 7.2 passing yards (66th) per attempt against FBS opponents.\n\nMore on the Falcons: Stats and trends\n\nPick: Despite Goff’s prowess, Cal's offense rarely matched Vegas’ expectations, scoring above its team total in just three games all season. Part of this is the Ds inability to stop the run, which ultimately keeps the ball out of his dangerous hands. Air Force should be able to produce on the ground, despite the talent gap between the teams. The SN staff will go against the line movement and play the UNDER 67.5 with a small lean to the Falcons +7.\n\nPlay Gamblino for free and win a $1,500 entry into the world's largest sports betting competition, The SuperContest.", "Baylor vs. UNC betting line and pick — Bears' injuries swing line in big way": "If you're reading this, it may already be too late. A flood of Baylor injuries have crippled the Bears' offense and swung this line about seven points since it opened.\n\nThe Tar Heels are now a 3.5-point favorite in the Russell Athletic Bowl on Tuesday (5:30 p.m. ET, ESPN).\n\nMORE: UNC-Baylor matchup page\n\nLine: UNC -3.5 Total: 69.5\n\nLine movement: Baylor opened -3.5 or -3 at most shops, and as the injuries and confirmations trickled down, it moved to a pick'em, then alway the way to North Carolina -3.5. Check out our live odds page for updated numbers from Las Vegas.\n\nTrends that matter: The UNDER is 1-3-1 in bowl games between the Big 12 and ACC in five games since 2008. Baylor went 7-5 on the OVER this season, UNC 7-6.\n\nUNC outlook: The Tar Heels finally broke out under Larry Fedora, and defensive coordinator Gene Chizik had a lot to do with that. UNC lost just twice, a dominating effort packed with two bad turnovers in its season-opener against South Carolina and in the ACC Championship Game against Clemson in a nail-biter.\n\nThis offense was as good as expected, with QB Marquise Williams averaging 8.2 yards per attempt and RB Elijah Hood gaining 6.5 yards per carry (1,345 overall) and 17 TDs. UNC's offense led the nation at 7.2 yards per play.\n\nDefensively, the Heels allowed 5.3 yars per play and ranked 56th in FBS per Football Outsiders. That's a big step up from year's past, when the defense seemed to hold them back.\n\nMORE: UNC stats and trends\n\nBaylor outlook: Baylor will be without its top receiver, running back and top two quarterbacks in this game. Chris Johnson will start at QB for the Bears, and he struggled mightily in limited time down the stretch. Against TCU, he went 7 of 24 for 62 yards with one TD and one pick. Against Texas, in a 23-17 loss as three-touchdown favorites, the Bears went away from the pass completely. Johnson went 3 of 4 for 20 yards.\n\nWe could talk all about Baylor's monster offensive numbers this season, but the Bears will be a completely different team without QBs Seth Russell and Jarrett Stidham, WR Corey Coleman and RB Shock Linwood. Art Briles' offense usually hums no matter who is under center, but that wasn't the case in the final two weeks of the season.\n\nBaylor's defense allowed 4.9 yards per play this season, 30th in the nation, and ranked 28th in efficiency, per Football Outsiders. So while the offense gets much of the credit for this team's success, this defense can hang with the best of them, too.\n\nMORE: Baylor stats and trends\n\nPick: Per Sports Insights, about 75 percent of spread bets have come in on North Carolina. If you haven't bet UNC yet, you missed the best price and most of the value, though they're a much healthier side at the moment and seem to be in much better form.\n\nAbout 80 percent of bettors are on the over. Baylor's last four bowl games under Art Briles have seen at least 75 points, but with the offense struggling mightily and both defenses better than perceived, we'll throw out a play on the UNDER at 69.5 or better.", "Bengals at Broncos props, odds and picks – Quarterback projections prompt wagers": "Fantasy Alarm's Week 16 player projections suggest Bengals QB AJ McCarron and Broncos signal caller Brock Osweiler present value if wagering on Las Vegas props for Monday night's (8:30 p.m. ET, ESPN) Cincinnati-Denver contest.\n\nThe Broncos are 3.5-point favorites to win, with a total at 39.5. Visit our odds page for updated NFL lines, and check out our betting preview and pick right here.\n\nThe Westgate Las Vegas SuperBook posts a total of 2.0 as the over-under for McCarron's touchdown passes + interceptions. Fantasy Alarm data predicts 2.5 (1.4 TDs, 1.1 INTs) for McCarron, making OVER the play.\n\nThe Westgate offers the same prop for Osweiler, with Fantasy Alarm's 2.5 (1.3 TDs, 1.2 INTs) projection suggesting another wager on OVER.\n\nThe SuperBook's props and odds, as well as applicable Fantasy Alarm projections,are as follows:\n\nBENGALS AT BRONCOS PROPS AND ODDS\n\nFIRST SCORE OF THE GAME WILL BE:\n\nTOUCHDOWN -135\n\nANY OTHER SCORE +115\n\nTOTAL COMPLETIONS BY: AJ McCARRON (CIN)\n\nOVER 19.5 -110\n\nUNDER 19.5 -110\n\nFantasy Alarm projection: 19.2\n\nTOTAL TOUCHDOWN PASSES+INTERCEPTIONS BY: AJ McCARRON (CIN)\n\nOVER 2.0 -160\n\nUNDER 2.0 +140\n\nFantasy Alarm projection: 2.5 (1.4 TDs, 1.1 INTs)\n\nWILL JEREMY HILL (CIN) SCORE A TOUCHDOWN?\n\nYES +120\n\nNO -140\n\nFantasy Alarm projection: 0.5\n\nTOTAL GROSS PASSING YARDS BY: BROCK OSWEILER (DEN)\n\nOVER 247.5 -110\n\nUNDER 247.5 -110\n\nFantasy Alarm projection: 272.6\n\nTOTAL TOUCHDOWN PASSES+INTERCEPTIONS BY: BROCK OSWEILER (DEN)\n\nOVER 2.0 -160\n\nUNDER 2.0 +140\n\nFantasy Alarm projection: 2.5 (1.3 TDs, 1.2 INTs)\n\nWILL DEMARYIUS THOMAS (DEN) SCORE A TOUCHDOWN?\n\nYES +115\n\nNO -135\n\nFantasy Alarm projection: 0.4\n\nTOTAL QB SACKS BY: BOTH TEAMS\n\nOVER 5.0 -120\n\nUNDER 5.0 EVEN\n\nTOTAL POINTS BY: BENGALS\n\nOVER 18.5 -110\n\nUNDER 18.5 -110\n\n\n\nTOTAL POINTS BY: BRONCOS\n\nOVER 21.5 -110\n\nUNDER 21.5 -110\n\n\n\n**PLAYERS MUST PLAY FOR ACTION; NO PARLAYS", "NFL bad beats, Week 16 - Coin toss decision, Hail Mary doom bettors": "Swipe left or right to navigate.\n\nUse left or right buttons to navigate.\n\nSwipe left or right to navigate.\n\nUse left or right buttons to navigate.\n\nThe bad beats were few this week, but boy were they stingers. A couple in fact, were darn right rare.\n\nA questionable overtime coin-toss decision by Bill Belichick in the Pats-Jets game and a last-play Hail Mary in Tampa are two scenarios that don't burn bettors often, but they did in Week 16.\n\nRead more about these two games and check out other insufferable wagering losses here.\n\nPlay Gamblino for free and win a $1,500 entry into the world's largest sports betting competition, The SuperContest.", "Central Michigan vs. Minnesota betting lines and pick — Gophers chalk in Quick Lane Bowl": "The Big Ten dominated the MAC straight-up this regular season, as it often does, but not necessarily against the spread. The two conferences will meet for the only time this bowl season in the Quick Lane Bowl (5 p.m. ET, ESPN2) on Monday when Minnesota takes on Central Michigan at Ford Field in Detroit.\n\nMinnesota went just 5-7 SU, but without enough 6-6 or better teams to fill every bowl game, the Golden Gophers reached the postseason thanks to its strong academic progress rate (APR).\n\nMORE: CMU-Minnesota matchup page\n\nLine: Minnesota -5, Total: 48.5\n\nLine movement: Minnesota opened at either -6 or -6.5 Vegas-wide, but was bet down to -5 at most spots the morning of the game. The total at Atlantis has dipped from 49.5 to 48, but it remains at 448.5 or 49 at a handful of other books. Check out our live odds page for updated numbers from Las Vegas.\n\nTrends that matter: Big Ten teams went 10-2 straight-up against MAC teams this season, but just 2-10 ATS; UNDERs went 7-5 in those matchups....Central Michigan's last five bowl games have been decided by three points or fewer....The Gophers finished the season on 4-1 ATS run, but just one came as a favorite.\n\nCentral Michigan outlook (7-5 SU, 9-3 ATS): The Chippewas went 9-3 ATS this season, but the numbers caught up to them a bit by the end of the year, finishing 2-3 ATS after a 7-0 start vs. the number.\n\nCMU is led by a stellar passing attack under QB Cooper Rush. The Chips were among the worst rushing teams in FBS, per Football Study Hall, but average 8.0 yards per pass attempt. Rush threw 25 TDs and 10 INTs while completing 67 percent of his passes and has a good company of weapons available. The Chips ran a higher percentage of passing plays than all but 11 FBS teams, but were 60th in plays per game, so this isn't a hurry-up, push-the-pace offense.\n\nThe CMU defense was actually its stronger unit, allowing 5.3 yards per play and ranking 58th in defensive efficiency, per Football Outsiders.\n\nMORE: Central Michigan stats and trends\n\nMinnesota outlook (5-7 SU, 6-6 ATS): The Gophers lost to five ranked opponents and dropped three games by six points or fewer. They had some of the worst turnover luck in the country, as well. Football Study Hall rates them 35th (per-play), while Football Outsiders (per-drive) has them 73rd, 12 spots behind Central Michigan.\n\nCoach Jerry Kill retired at the end of October for health reasons, and long-time confidant Tracy Claeys took his place. Minnesota covered four of its final five games under Claeys after starting 2-5 ATS. There could be a bit of a motivational lull for the Gophers playing in Detroit against a perceived inferior opponent, but Claeys should have this team ready to go.\n\nQB Mitch Leidner had a disappointing season, completing 57 percent of his passes at 6.1 yards per attempt. The Gophers offense averaged 5.2 yards per play, but 6.1 over its last three games.\n\nMinnesota's only All-Big Ten players came in the secondary, and the Gophers allowed 6.0 yards per pass attempt, 18th in FBS. Their passer-rating against was 26th. So Minny has the defensive prowess (55th in overall efficiency), especially in the back, to slow CMU's passing attack.\n\nMORE: Minnesota stats and trends\n\nPick: Kill has been in and out of the program over the last few years while battling heart troubles, and Claeys has done excellent in his place. This team was motivated and winning to close the season under him. Central Michigan did well in John Bonamego's first year, but may have peaked a little early.\n\nExpect Minnesota to be ready despite the lackluster destination — at 5-7, the Gophers should want to prove they belong in the postseason. Gophers -5 or better is the play from the SN staff, though if you like Central Michigan, we recommend taking the moneyline, since it's possible Minnesota elects to not show up. We'll also throw out a play on the UNDER at 49 or better, since Minnesota should slow down CMU's passing attack, and the Gophers offense has been sluggish all year. The two best units in this game are the defenses.\n\nMore Monday football: Pitt vs. Navy | Bengals at Broncos\n\nPlay Gamblino for free and win a $1,500 entry into the world's largest sports betting competition, The SuperContest.", "NFL Week 17 opening lines – Point spreads, totals for season's final Sunday": "Many pieces of the NFL playoff puzzle have yet to fall into place, but it'll all be figured out in Week 17. Here the early betting lines for the final Sunday of the season.\n\nPoint spreads and totals are the Las Vegas consensus as of Monday morning. Check our odds page for updated Vegas lines.\n\nSunday, Jan. 2\n\nJets (-3, 43) at Bills\n\nThe Jets opened between -1 (Wynn) and -2.5 (William Hill), numbers that drew immediate interest from favorite bettors. The Westgate moved from -1.5 to -3 (even) by Monday morning, while The Wynn adjusted to -2.5 on Sunday night.\n\nBucs at Panthers (-10, 47)\n\nThe Westgate opened Carolina -9.5 and moved to -10 after 40 minutes of wagering. CG Technology came a bit higher at -10.5. The Panthers are still playing for the top seed in the NFC, as they’re just a game ahead of the Cardinals.\n\nPatriots (-9) at Dolphins\n\nNew England opened -8 at the Westgate, but the sports book joined other shops at -9 in Sunday night wagering. Underdog bettors take note: the Pats were -8 at home against the Dolphins in Week 8 in a 36-7 win.\n\nRavens at Bengals (-7)\n\nWhether they win or lose Monday night in Denver, the Bengals will have plenty of incentive at home vs. the Ravens next week.\n\nSaints at Falcons (-2)\n\nThis line should get the attention of favorite bettors since Atlanta was bigger chalk (-3) when these teams played in New Orleans in Week 6. Of course, that’s when the Saints handed the Falcons their first loss of the season, 31-21.\n\nJaguars at Texans (-5.5)\n\nCG and William Hill opened Houston -6, the former sticking at that number through Monday morning and the latter moving to -5.5 on Sunday night.\n\nSteelers (-10, 47) at Browns\n\nThe Westgate opened Pitt -8.5 with a one-flash move to -9.5 after about 30 minutes of betting. Most shops hung -10 and stood pat as of this Monday morning post. The Steelers need a win and some help to get into the playoffs.\n\nRaiders at Chiefs (-6.5, 43.5)\n\nKansas City opened -7 (even) at The Wynn. The Chiefs are in the playoffs but have incentive in Week 17, as the AFC West title is within striking distance.\n\nTitans at Colts (no line)\n\nIndy’s quarterback situation remains uncertain.\n\nRedskins at Cowboys (-3.5)\n\nDallas opened -4 at the Westgate, with a move to -3.5 after a few hours of wagering. Washington has clinched the NFC East and has little incentive next week since its playoff position can’t improve.\n\nLions at Bears (-1, 45)\n\nThis spread opened Chicago -1.5 at most shops, all of which moved to -1 in Sunday night betting action.\n\nEagles at Giants (-3.5)\n\nBoth teams’ postseason hopes are toast.\n\nVikings at Packers (-3)\n\nThis de facto NFC North championship game has been flexed into NBC’s primetime slot. The first meeting of the season, won 30-13 by Green Bay in Minnesota, was a pick 'em. The Packers are 7-1-1 SU and 7-2 ATS the last nine time they’ve hosted the Vikes, and they’re typically laying much bigger numbers against this division foe.\n\nChargers at Broncos (-7.5)\n\nThis line represents a modest swing from the first meeting of the season between these teams. Denver was a 17-3 victor as a 5.5-point favorite in San Diego on Dec. 6.\n\nRams (-3.5, 37.5) at 49ers\n\nThe total for this meaningless game jumps out at you, doesn’t it?\n\nSeahawks at Cardinals (-3.5, 47.5)\n\nArizona earns home-field advantage throughout the NFC playoffs with a win and a Panthers loss to Tampa Bay. While Seattle is locked into a wild-card spot, a win next week may mean the difference between a trip to Washington, or one to Green Bay or Minnesota in the first round of the playoffs.\n\nPlay Gamblino for free and win a $1,500 entry into the world's largest sports betting competition, The SuperContest.", "Manchester United vs. Chelsea odds and pick – Red Devils reeling ahead of visit from Blues": "Manchester United will be desperate to get its season back on track when it welcomes Chelsea to Old Trafford in Monday’s Premier League clash (2:45 p.m. ET, NBC Sports Network).\n\nUnder pressure after overseeing four consecutive defeats, Louis Van Gaal is priced at +140 odds at the Westgate Las Vegas SuperBook to secure a morale-boosting victory here.\n\nMeanwhile, Guus Hiddink has collected four points from two matches since taking temporary command at Chelsea, and is available at +210 odds to mastermind a win in this one.\n\nEach of the last two encounters at this ground have resulted in draws, and you can get odds of +225 on them cancelling each other out once again.\n\nThe game is a pick ‘em on the spread bet, with Man U backers required to lay -140 and Chelsea available for +120.\n\nMore soccer betting info: Goal.com has you covered\n\nAlthough Van Gaal has never truly endeared himself to the fans due to his rather methodical style of play, he has been granted the benefit of the doubt while results remain strong.\n\nHowever, a run of seven games without a win now sees the Dutchman on seriously thin ice, thanks primarily due to the collapse of Manchester United’s previously strong defense.\n\nHaving conceded just three goals in the previous 11 matches, the Red Devils have now let in nine in just four games coming into this clash.\n\nThis does not bode well as they prepare to take on a team seemingly unleashed under new management, having scored as many goals in two league games as it had in the previous eight.\n\nNevertheless, with the Blues also looking less than watertight at the back, it seems unlikely that the goalmouth action will be restricted to just one end of the pitch.\n\nWith this in mind, odds of +125 look too good to miss on OVER 2.5 goals being scored for the fourth consecutive Chelsea match and fourth in five for Manchester United.\n\nGoal.com best bet: OVER 2.5 goals (+125)\n\nThis story has been edited since its original version on Goal.com to reflect the odds offered in Las Vegas.", "Super Bowl odds — Steelers drop back, Cardinals now NFC favorites": "The Steelers got plenty of respect from oddsmakers last week despite not being locked into the postseason, and now Pittsburgh's journey is even tougher following a loss at Baltimore as double-digit favorites. Still, the Westgate Las Vegas SuperBook has the Steelers at 10-1, tied for the fifth-best odds behind the Seahawks, Cardinals, Panthers and Patriots.\n\nPittsburgh (-10) needs to win at Cleveland and a Jets (-3) loss at Buffalo to stay alive. The Chiefs have already clinched one of the AFC's wild card berths. Both the Broncos and Bengals can still clinch first-round byes because of New York's overtime win over the Patriots, which is they now sit at 10-1 as opposed to 12-1 and 14-1, like they were last week.\n\nThe Cardinals are now NFC favorites at 3-2 and Super Bowl co-favorites at 7-2 after stomping the Packers at home on Sunday. The Panthers fell back slightly to 9-2 to win it all, but will still clinch home field throughout the playoffs with a win at home against the Bucs (-10.5) or a Cardinals (-6) loss at home against the Seahawks.\n\nMORE: Week 16 bad beats | SN's NFL power rankings\n\nThe Jets dropped from 100-1 to 30-1 with that win over the Patriots and the Colts fell all the way to 2000-1. The board is getting smaller and smaller.\n\nOdds listed in parentheses are last week's if different.\n\nSuper Bowl 50 game line\n\nNFC (pick'em) vs. AFC; Total: 51.5\n\nOdds to win Super Bowl 50\n\nSEAHAWKS 6-1 (5-1)\n\nPATRIOTS 7-2\n\nPACKERS 16-1 (10-1)\n\nBRONCOS 10-1 (12-1)\n\nCOLTS 2000-1 (300-1)\n\nCARDINALS 7-2 (5-1)\n\nSTEELERS 10-1 (6-1)\n\nBENGALS 10-1 (14-1)\n\nTEXANS 40-1 (50-1)\n\nCHIEFS 20-1 (25-1)\n\nPANTHERS 9-2 (4-1)\n\nVIKINGS 30-1\n\nREDSKINS 50-1 (60-1)\n\nJETS 30-1 (100-1)\n\nTo win the NFC\n\nSEAHAWKS 3\n\nPACKERS 8\n\nCARDINALS 3-2\n\nPANTHERS 2\n\nVIKINGS 15\n\nREDSKINS 25\n\nTo win the AFC\n\nPATRIOTS 6-5\n\nBRONCOS 9-2\n\nCOLTS 1000\n\nSTEELERS 9-2\n\nBENGALS 9-2\n\nTEXANS 20\n\nCHIEFS 10\n\nJETS 15", "Colorado St. vs. Nevada betting line and pick — Wolfpack a live dog in Arizona Bowl?": "AccuScore’s computer simulates games 10,000 times to predict their outcome. Throughout the college football season, we’ll be stacking up these forecasts against Las Vegas money-lines. When AccuScore gives a team a better chance to win than the money-line odds imply, it’s a recommended play.\n\nColorado State enters Tuesday's Arizona Bowl as 3-point favorites against Nevada, with the total set at 56. The Rams have dominated the Wolfpack in recent memory, but this Nevada roster just may have the necessary pieces — specifically James Butler and Hasaan Henderson — to pull off the upset.\n\nRams money-line bettors are required to lay -160 odds, with the Wolfpack getting +140 odds in Las Vegas. The odds in Vegas indicate a 41.7 percent chance of winning for Nevada; in AccuScore simulations, however, they won 44 percent of simulations. AccuScore would have listed Nevada's money-line odds at +125.\n\nMORE: Arizona Bowl matchup page\n\nBoth AccuScore data and Vegas odds have the total and spread set at the same values. The OVER is a two-star hot trend (out of four); AccuScore has gone 28-21 (57.1%, +490 units) when picking on Mountain West Conference totals. The average score after 10,000 simulations is 30-27. The total has gone OVER in 4 of Colorado State's last 6 games.\n\nPlayers to Watch\n\nNevada QB Tyler Stewart is projected to finish with 206 yards, 2 TDs, 1 INT and a passer rating of 119.9. He averages 1.5 TDs and 0.9 INTs per sim.\n\nColorado State QB Nick Stevens is projected to finish with 274 yards, 2 TDs, 1 INT and a passer rating of 146.4. Stevens averages 2.0 TDs and 1.2 INTs per sim.\n\nWolfpack RB James Butler is projected to lead the way on the ground with 106 yards on 16 carries. He averages 0.8 TDs per sim. Also keep an eye on teammate Don Jackson who is projected to get more carries (19), but fewer total yards (90). He averages 0.7 TDs per sim.\n\nFor the Rams, Dalyn Dawkins is projected to finish with 90 yards on 16 carries. He averages 0.6 TDs per sim. Izzy Matthews — who also averages 0.6 TDs per sim — is projected to finish with 70 yards on 12 carries.\n\nWR Hasaan Henderson is projected to finish with 74 yards on 6 receptions, averaging 0.5 TDs per sim. Colorado St. Rashard Higgins is projected to finish with 91 yards on 7 receptions, averaging 0.7 TDs per sim.\n\nVisit AccuScore.com for more betting analysis and picks"}